# 3x3の2次元配列となる予定の配列
C = []

for _ in range(0, 3):
  # Cの1行分を表す1次元配列
  row = list(map(int, input().split()))

  C.append(row)

# 矛盾していないかどうか保持する変数
# 矛盾していたらFalse
ok = True

# Cの0列目と1列目の差を調べ、すべて同じでなければ矛盾
if C[0][0] - C[0][1] != C[1][0] - C[1][1] or C[1][0] - C[1][1] != C[2][0] - C[2][1]:
  ok = False

# Cの1列目と2列目の差を調べ、すべて同じ値でなければ矛盾
if C[0][1] - C[0][2] != C[1][1] - C[1][1] or C[1][1] - C[1][2] != C[2][1] - C[2][2]:
  of = False

# Cの0行目と1行目の差を調べ、すべて同じでなければ矛盾
if C[0][0] - C[1][0] != C[0][1] - C[1][1] or C[0][1] - C[1][1] != C[0][2] - C[1][2]:
  ok = False

# Cの1行目と2行目の差を調べ、すべて同じ値でなければ矛盾
if C[1][0] - C[2][0] != C[1][1] - C[2][1] or C[1][1] - C[2][1] != C[1][2] - C[2][2]:
  of = False

if ok:
  print("Yes")
else:
  print("No")